---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.DuplicateEntry
source: html/0555b1bf-8d19-8958-a9d0-37a33e843937.htm
---
# Autodesk.Revit.DB.BuiltInFailures.KeyBasedTreeEntryFailures.DuplicateEntry Property

Duplicate code '[Code]', description: '[Description]'

## Syntax (C#)
```csharp
public static FailureDefinitionId DuplicateEntry { get; }
```